## staging: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                       |
|--------|--------------------------------------------------|
| add    | `newrelic_workflow.terraform_notify_workflow[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
19:48:51.334 STDOUT terraform:   + create
19:48:51.334 STDOUT terraform: Terraform will perform the following actions:
19:48:51.335 STDOUT terraform:   # newrelic_workflow.terraform_notify_workflow[0] will be created
19:48:51.335 STDOUT terraform:   + resource "newrelic_workflow" "terraform_notify_workflow" {
19:48:51.335 STDOUT terraform:       + account_id            = (sensitive value)
19:48:51.335 STDOUT terraform:       + destinations_enabled  = true
19:48:51.335 STDOUT terraform:       + enabled               = true
19:48:51.335 STDOUT terraform:       + enrichments_enabled   = true
19:48:51.335 STDOUT terraform:       + guid                  = (known after apply)
19:48:51.335 STDOUT terraform:       + id                    = (known after apply)
19:48:51.335 STDOUT terraform:       + last_run              = (known after apply)
19:48:51.335 STDOUT terraform:       + muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES"
19:48:51.335 STDOUT terraform:       + name                  = "Notify Workflow - staging"
19:48:51.335 STDOUT terraform:       + workflow_id           = (known after apply)
19:48:51.335 STDOUT terraform:       + destination {
19:48:51.335 STDOUT terraform:           + channel_id              = "6f42c4f7-75f5-49e0-8da5-b6ff854f42b1"
19:48:51.335 STDOUT terraform:           + name                    = (known after apply)
19:48:51.335 STDOUT terraform:           + notification_triggers   = [
19:48:51.335 STDOUT terraform:               + "ACKNOWLEDGED",
19:48:51.335 STDOUT terraform:               + "ACTIVATED",
19:48:51.335 STDOUT terraform:               + "CLOSED",
19:48:51.335 STDOUT terraform:             ]
19:48:51.335 STDOUT terraform:           + type                    = (known after apply)
19:48:51.335 STDOUT terraform:           + update_original_message = true
19:48:51.335 STDOUT terraform:         }
19:48:51.335 STDOUT terraform:       + issues_filter {
19:48:51.335 STDOUT terraform:           + filter_id = (known after apply)
19:48:51.335 STDOUT terraform:           + name      = "workflow-filter"
19:48:51.335 STDOUT terraform:           + type      = "FILTER"
19:48:51.335 STDOUT terraform:           + predicate {
19:48:51.335 STDOUT terraform:               + attribute = "labels.policyIds"
19:48:51.335 STDOUT terraform:               + operator  = "EXACTLY_MATCHES"
19:48:51.335 STDOUT terraform:               + values    = [
19:48:51.335 STDOUT terraform:                   + "6585922",
19:48:51.336 STDOUT terraform:                 ]
19:48:51.336 STDOUT terraform:             }
19:48:51.336 STDOUT terraform:           + predicate {
19:48:51.336 STDOUT terraform:               + attribute = "priority"
19:48:51.336 STDOUT terraform:               + operator  = "EQUAL"
19:48:51.336 STDOUT terraform:               + values    = [
19:48:51.336 STDOUT terraform:                   + "CRITICAL",
19:48:51.336 STDOUT terraform:                 ]
19:48:51.336 STDOUT terraform:             }
19:48:51.336 STDOUT terraform:         }
19:48:51.336 STDOUT terraform:     }
19:48:51.336 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
19:48:51.336 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:48:51.336 STDOUT terraform: Saved the plan to: plan.tfplan
19:48:51.336 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:48:51.336 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
